CSI API ETABS v1
cStory.SetElevation Method
 Sets the elevation of a defined story
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetElevation(
	string Name,
	double Elevation
)
Function SetElevation (
	Name As String,
	Elevation As Double
) As Integer
Dim instance As cStory
Dim Name As String
Dim Elevation As Double
Dim returnValue As Integer
returnValue = instance.SetElevation(Name,
	Elevation)
int SetElevation(
	String^ Name,
	double Elevation
)
abstract SetElevation :
        Name : string *
        Elevation : float -> int
Parameters
Name
Type: System.String
 The name of a defined story
Elevation
Type: System.Double
 The elevation of the story
Return Value
Type: Int32
 Returns zero if the value is successfully set, otherwise returns nonzero.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'set story elevation
       ret = SapModel.Story.SetElevation("Story2", 25)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cStory Interface
ETABSv1 Namespace